000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300 AUTHOR. FINN B.
000400*SIMPLE HELLO WORLD PROGRAM.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700 01  WS-NAME PIC A(6) VALUE IS 'FINN'.
000800
000900 PROCEDURE DIVISION.
001000     DISPLAY "Hello : "WS-NAME.
001100     STOP RUN.