000100 INDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300* simple hello world program
000400 DATA DIVISION.
000500     WORKING-STORAGE SECTION.
000600     01 WS-NAME PIC A(6) VALUE IS 'FINN'.                           
000700
000800 PROCEDURE DIVISION.
000900     DISPLAY "Hello : "WS-NAME.
001000
001100 STOP RUN.